<?php


/*$a=10;
$b=3;

echo $a%$b;*/

/*echo $st=pow(2,10);*/

/*echo round(sqrt(379));*/

/*echo min(4, -2, 5, 19, -130, 0, 10) .PHP_EOL;
echo max(4, -2, 5, 19, -130, 0, 10);*/

//echo mt_rand(1,100) .PHP_EOL;

/*$a=87;
$b=178;
echo abs($a-$b) .'<br>';*/


//$a=30;

/*
$str = "html css php";
$arr = explode(' ', $str);
print_r($arr);*/

/*N13
$arr=[1, 2, 3, 4, 5];

var_dump(array_slice($arr, 1, 3));*/

/*$arr=[1, 2, 3, 4, 5];
array_splice($arr,1,2);
var_dump($arr);*/


/* N1 Дан массив с числами. Найдите среднее арифметическое его элементов (сумма элементов делить на количество) не используя цикл


$arr=[3, 8, 9, 7, 17889];

echo $result=array_sum($arr)/count($arr);*/


/* N2  Найдите сумму чисел от 1 до 100 не используя цикл.
$arr=range(1,100, 1);
echo array_sum($arr);*/

/* N 3  Выведите столбец чисел от 1 до 100 не используя цикл.
$arr=range(1,100, 1);
echo implode('<br>',$arr);*/

/*N4 Заполните массив 10-ю иксами не используя цикл
$arr=array_fill(1, 10, 'x');
print_r($arr);*/

/* N5 Заполните массив 10-ю случайными числами от 1 до 10 так, чтобы они не повторялись. Цикл использовать нельзя
$arr=range(1,10);
shuffle($arr);
print_r($arr);*/


/* N6 Найдите факториал заданного числа не используя цикл. Факториал - это произведение чисел от 1 до заданного числа включительно.
$a=4;
$arr=range(1,$a);
print_r(array_product($arr));*/

/* N7 Дано число. Найдите сумму цифр этого числа не используя цикл
$num=1445;
$arr=str_split($num,1);
print_r (array_sum($arr));*/

//  N8 Дана строка. Сделайте заглавным последний символ этой строки не используя цикл
$str='ngfjtdkd';



